#include<stdio.h>

int main(void)
{
    printf("运算优先级 Order of operations\n");
    printf("观察这个表达式：3 + 4 * 5;,你认为他会返回什么结果");
    printf("正确答案是%i,从数学上来讲,这是正确的"
        ",为什么不是35？这是因为运算有优先级。" , 3 + 4 * 5);
    printf("上面示例中,表达式3 + 4 * 5里面既有加法运算符（+）"
        ",又有乘法运算符（*）。由于乘法的优先级高于加法,所以会先计算4 * 5,而不是先计算3 + 4。\n");
    printf("如果两个运算符优先级相同,则根据运算符是左结合,还是右结合,决定执行顺序。"
        "大部分运算符是左结合（从左到右执行）,少数运算符是右结合（从右到左执行）,比如赋值运算符（=）。\n");
    printf("如：5 * 6 /7,它的运算优先级相同,结果是：%i\n" , 5 * 6 / 7);

    printf("运算符的优先级顺序很复杂。下面是部分运算符的优先级顺序（按照优先级从高到低排列）。\n");
    printf(
        "圆括号（()）\n"
        "自增运算符（++）,自减运算符（--）\n"
        "一元运算符（+和-）\n"
        "乘法（*）,除法（/）\n"
        "加法（+）,减法（-）\n"
        "关系运算符（<、>等）\n"
        "赋值运算符（=）\n"
        );
    
    int x = ( 3 + 4 ) * 5;
    printf(
        "由于圆括号的优先级最高,可以使用它改变其他运算符的优先级。\n"
        "int x = (3 + 4) * 5;\n"
        "结果为%i\n" , x);
    printf("完全记住所有运算符的优先级没有必要,解决方法是多用圆括号"
        ",防止出现意料之外的情况,也有利于提高代码的可读性。\n");
    return 0;
}